"""
4. Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна 
повертати якийсь результат. Також створiть четверу ф-цiю, яка в тiлi 
викликає 3 попереднi, обробляє повернутий ними результат та також 
повертає результат. Таким чином ми будемо викликати 1 функцiю, 
а вона в своєму тiлi ще 3
"""


def part1():
    return str("Вконце концов, ")


def part2():
    return str("среди концов, ")


def part3():
    return str("нашли конец мы ")


def start():
    return print(f"{part1()}{part2()}{part3()}наконец!!!")


start()
