"""
5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), 
пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при 
нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z
"""


def dif(x, y):
    if int(x) > int(y): print(f"вiдповiдь - {x} бiльше нiж {y} на {x - y}")
    if int(y) > int(x): print(f"вiдповiдь - {y} бiльше нiж {x} на {y - x}")
    if int(x) == int(y): print(f"вiдповiдь - {x} дорівнює {y}")
    return


dif(int(input("input x = ")), int(input("input y = ")))
