"""
2. Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
   На екран повинен вивестись список із трьома блоками - символи з початку, 
   із середини та з кінця файлу.
   Кількість символів в блоках - та, яка введена в другому параметрі.
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів 
   більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по 
   одному символу, то що виводити на місці середнього блоку символів?)
   В репозиторій додайте і ті файли, по яким робили тести.
   Як визначати середину файлу (з якої брать необхідні символи) - кількість 
   символів поділити навпіл, а отримане "вікно" символів відцентрувати щодо 
   середини файла і взяти необхідну кількість. В разі необхідності 
   заокруглення одного чи обох параметрів - дивіться на свій розсуд.
   Наприклад:
   █ █ █ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ ░ █ █ █    - правильно
                     ⏫ центр

   █ █ █ ░ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ █ █ █    - неправильно
                     ⏫ центр

"""


def listFromFile(filename, symbols):
    with open(str(filename)) as file:
        f = file.read()
    start = ""
    stop = ""
    center = ""
    if len(f) in range(0, symbols * 3):
        print(f"File contains less symbols then you need ")
    else:
        start = f[:symbols]
        stop = f[-symbols:]
        cut = int((len(f)-symbols)/2)
        center = f[cut:cut + symbols]
    print(f"{start}\t{center}\t{stop}")


listFromFile(777, 1)
